src/load-test.yml
config:
  target: "http://localhost:9000"
  phases:
    - duration: 2
      arrivalRate: 1
scenarios:
  - flow:
      - get:
          url: "/api/v1/auth/registration"
          json:
           id: userDatabase.users.length + 1,
           name: "Gbubemi"
           email: "test@test.com"
           password: "Webnet223@"
  - flow:
      - post:
          url:  "/api/v1/flights"
          json:
            id: flightDatabase.flights.length + 1,
            departureCity: "Lagos"
            destinationCity: "Abuja"
            date: "2023-09-28"
  - flow:
      - post:
          url: "/api/v1/bookings/2"
          json:
             id: bookingDatabase.bookings.length + 1,
             flightId: 3